var itemtypenames;
if (itemtypenames == undefined)
  itemtypenames = [
    "Small Caliber Main Gun",
    "Medium Caliber Main Gun",
    "Large Caliber Main Gun",
    "Secondary Gun",
    "Anti-Aircraft Gun",
    "Anti-Aircraft Shell",
    "Armor Piercing Shell",
    "Torpedos & Submarine",
    "Carrier-Based Fighter",
    "Carrier-Based Torpedo Bomber",
    "Carrier-Based Dive Bomber",
    "Carrier-Based Reconn",
    "Seaplane",
    "Radar",
    "Anti-submarine Warfare",
    "Engine",
    "Extra Armor",
    "Land-Based Attack Aircraft",
    "Supply Transport Container",
    "Anti-Air Fire Director",
    "Land-based Fighter",
  ];

// Id, Name, Rarity, Internal Rarity, Type, Break Materials[, is AA]
// const itemlist = [
//   [1, "12cm単装砲", 1, 0, 0, [0, 1, 1, 0]],
//   [2, "12.7cm連装砲", 1, 0, 0, [0, 1, 2, 0]],
//   [3, "10cm連装高角砲", 2, 1, 0, [0, 1, 3, 0], true],
//   [4, "14cm単装砲", 1, 0, 1, [0, 2, 1, 0]],
//   [5, "15.5cm三連装砲", 2, 0, 1, [0, 2, 5, 0]],
//   [6, "20.3cm連装砲", 2, 0, 1, [0, 3, 4, 0]],
//   [7, "35.6cm連装砲", 1, 0, 2, [0, 10, 15, 0]],
//   [8, "41cm連装砲", 2, 1, 2, [0, 12, 20, 0]],
//   [9, "46cm三連装砲", 3, 2, 2, [0, 24, 25, 0]],
//   [10, "12.7cm連装高角砲", 1, 0, 3, [0, 2, 2, 0], true],
//   [11, "15.2cm単装砲", 1, 0, 3, [0, 2, 2, 0]],
//   [12, "15.5cm三連装副砲", 2, 1, 3, [0, 2, 5, 0]],
//   [13, "61cm三連装魚雷", 1, 0, 7, [1, 1, 1, 0]],
//   [14, "61cm四連装魚雷", 1, 0, 7, [1, 2, 2, 0]],
//   [15, "61cm四連装(酸素)魚雷", 2, 1, 7, [2, 2, 2, 0]],
//   [16, "九七式艦攻", 1, 0, 9, [1, 1, 0, 2]],
//   [17, "天山", 2, 1, 9, [2, 4, 0, 4]],
//   [18, "流星", 3, 2, 9, [2, 5, 0, 10]],
//   [19, "九六式艦戦", 1, 0, 8, [1, 1, 0, 1]],
//   [20, "零式艦戦21型", 1, 0, 8, [1, 1, 0, 2]],
//   [21, "零式艦戦52型", 2, 1, 8, [1, 2, 0, 3]],
//   [22, "試製烈風 後期型", 3, 3, 8, [2, 2, 0, 9]],
//   [23, "九九式艦爆", 1, 0, 10, [1, 1, 0, 2]],
//   [24, "彗星", 2, 1, 10, [2, 3, 0, 3]],
//   [25, "零式水上偵察機", 1, 1, 12, [1, 1, 0, 2]],
//   [26, "瑞雲", 2, 1, 12, [2, 3, 0, 5]],
//   [27, "13号対空電探", 2, 1, 13, [0, 0, 10, 10]],
//   [28, "22号対水上電探", 2, 1, 13, [0, 0, 15, 15]],
//   [29, "33号対水上電探", 3, 2, 13, [0, 0, 20, 15]],
//   [30, "21号対空電探", 2, 2, 13, [0, 0, 20, 20]],
//   [31, "32号対水上電探", 3, 3, 13, [0, 0, 20, 25]],
//   [32, "42号対空電探", 3, 4, 13, [0, 0, 25, 25]],
//   [33, "改良型艦本式タービン", 1, 0, 15, [10, 0, 10, 0]],
//   [34, "強化型艦本式缶", 2, 1, 15, [10, 0, 20, 0]],
//   [35, "三式弾", 2, 0, 5, [0, 9, 6, 3]],
//   [36, "九一式徹甲弾", 3, 1, 6, [0, 3, 9, 0]],
//   [37, "7.7mm機銃", 1, 0, 4, [0, 1, 1, 0]],
//   [38, "12.7mm単装機銃", 1, 0, 4, [0, 1, 1, 0]],
//   [39, "25mm連装機銃", 2, 0, 4, [0, 2, 1, 0]],
//   [40, "25mm三連装機銃", 2, 1, 4, [0, 3, 1, 0]],
//   [41, "甲標的 甲型", 1, 1, 7, [0, 7, 7, 0]],
//   [44, "九四式爆雷投射機", 1, 0, 14, [0, 2, 1, 1]],
//   [45, "三式爆雷投射機", 3, 2, 14, [0, 3, 1, 1]],
//   [46, "九三式水中聴音機", 1, 0, 14, [0, 0, 1, 1]],
//   [47, "三式水中探信儀", 3, 2, 14, [0, 0, 1, 2]],
//   [49, "25mm単装機銃", 2, 1, 4, [0, 1, 1, 0]],
//   [51, "12cm30連装噴進砲", 4, 2, 4, [0, 4, 2, 2]],
//   [52, "流星改", 3, 3, 9, [2, 6, 0, 10]],
//   [54, "彩雲", 3, 2, 11, [2, 0, 0, 11]],
//   [55, "紫電改二", 3, 2, 8, [2, 2, 0, 7]],
//   [57, "彗星一二型甲", 3, 2, 10, [2, 3, 0, 4]],
//   [59, "零式水上観測機", 2, 1, 12, [1, 1, 0, 2]],
//   [60, "零式艦戦62型(爆戦)", 3, 2, 10, [1, 3, 0, 3]],
//   [61, "二式艦上偵察機", 2, 1, 11, [3, 1, 0, 13]],
//   [65, "15.2cm連装砲", 2, 2, 1, [0, 2, 3, 0]],
//   [66, "8cm高角砲", 3, 3, 3, [0, 1, 2, 0], true],
//   [72, "増設バルジ(中型艦)", 2, 2, 16, [0, 0, 12, 0]],
//   [73, "増設バルジ(大型艦)", 2, 2, 16, [0, 0, 30, 0]],
//   [75, "ドラム缶(輸送用)", 1, 0, 18, [0, 0, 1, 0]],
//   [90, "20.3cm(2号)連装砲", 2, 1, 1, [0, 3, 4, 0]],
//   [120, "91式高射装置", 1, 1, 19, [0, 1, 0, 1]],
//   [181, "零式艦戦32型", 2, 3, 8, [1, 2, 0, 2]],
//   [226, "九五式爆雷", 1, 1, 14, [1, 2, 0, 1]],
//   [78, "12.7cm単装砲", 1, 0, 0, [1, 1, 1, 1]],
//   [147, "120mm/50 連装砲", 2, 2, 0, [0, 1, 2, 0]],
//   [163, "Ro.43水偵", 3, 3, 12, [1, 1, 0, 2]],
//   [168, "九六式陸攻", 1, 1, 17, [7, 4, 0, 12]],
//   [194, "Laté 298B", 3, 3, 12, [2, 4, 0, 5]],
//   [195, "SBD", 2, 2, 10, [1, 3, 0, 2]],
//   [197, "F4F-3", 2, 2, 8, [1, 2, 0, 2]],
//   [207, "瑞雲(六三一空)", 3, 3, 12, [2, 3, 0, 5]],
//   [242, "Swordfish", 2, 2, 9, [1, 1, 0, 1]],
//   [249, "Fulmar", 2, 2, 8, [1, 2, 0, 2]],
//   [250, "Spitfire Mk.I", 3, 3, 20, [1, 2, 0, 4]],
// ];

const materialNames = ["Fuel", "Ammunition", "Steel", "Bauxite"];

const items = [
  [1, "12cm単装砲", 1, 0, 0, [0, 1, 1, 0], false],
  [2, "12.7cm連装砲", 1, 0, 0, [0, 1, 2, 0], false],
  [3, "10cm連装高角砲", 2, 1, 0, [0, 1, 3, 0], true],
  [78, "12.7cm単装砲", 1, 0, 0, [1, 1, 1, 1], false],
  [147, "120mm/50 連装砲", 2, 2, 0, [0, 1, 2, 0], false],
  [4, "14cm単装砲", 1, 0, 1, [0, 2, 1, 0], false],
  [5, "15.5cm三連装砲", 2, 0, 1, [0, 2, 5, 0], false],
  [6, "20.3cm連装砲", 2, 0, 1, [0, 3, 4, 0], false],
  [65, "15.2cm連装砲", 2, 2, 1, [0, 2, 3, 0], false],
  [90, "20.3cm(2号)連装砲", 2, 1, 1, [0, 3, 4, 0], false],
  [7, "35.6cm連装砲", 1, 0, 2, [0, 10, 15, 0], false],
  [8, "41cm連装砲", 2, 1, 2, [0, 12, 20, 0], false],
  [9, "46cm三連装砲", 3, 2, 2, [0, 24, 25, 0], false],
  [10, "12.7cm連装高角砲", 1, 0, 3, [0, 2, 2, 0], true],
  [11, "15.2cm単装砲", 1, 0, 3, [0, 2, 2, 0], false],
  [12, "15.5cm三連装副砲", 2, 1, 3, [0, 2, 5, 0], false],
  [66, "8cm高角砲", 3, 3, 3, [0, 1, 2, 0], true],
  [37, "7.7mm機銃", 1, 0, 4, [0, 1, 1, 0], false],
  [38, "12.7mm単装機銃", 1, 0, 4, [0, 1, 1, 0], false],
  [39, "25mm連装機銃", 2, 0, 4, [0, 2, 1, 0], false],
  [40, "25mm三連装機銃", 2, 1, 4, [0, 3, 1, 0], false],
  [49, "25mm単装機銃", 2, 1, 4, [0, 1, 1, 0], false],
  [51, "12cm30連装噴進砲", 4, 2, 4, [0, 4, 2, 2], false],
  [35, "三式弾", 2, 0, 5, [0, 9, 6, 3], false],
  [36, "九一式徹甲弾", 3, 1, 6, [0, 3, 9, 0], false],
  [13, "61cm三連装魚雷", 1, 0, 7, [1, 1, 1, 0], false],
  [14, "61cm四連装魚雷", 1, 0, 7, [1, 2, 2, 0], false],
  [15, "61cm四連装(酸素)魚雷", 2, 1, 7, [2, 2, 2, 0], false],
  [41, "甲標的 甲型", 1, 1, 7, [0, 7, 7, 0], false],
  [19, "九六式艦戦", 1, 0, 8, [1, 1, 0, 1], false],
  [20, "零式艦戦21型", 1, 0, 8, [1, 1, 0, 2], false],
  [21, "零式艦戦52型", 2, 1, 8, [1, 2, 0, 3], false],
  [22, "試製烈風 後期型", 3, 3, 8, [2, 2, 0, 9], false],
  [55, "紫電改二", 3, 2, 8, [2, 2, 0, 7], false],
  [181, "零式艦戦32型", 2, 3, 8, [1, 2, 0, 2], false],
  [197, "F4F-3", 2, 2, 8, [1, 2, 0, 2], false],
  [249, "Fulmar", 2, 2, 8, [1, 2, 0, 2], false],
  [16, "九七式艦攻", 1, 0, 9, [1, 1, 0, 2], false],
  [17, "天山", 2, 1, 9, [2, 4, 0, 4], false],
  [18, "流星", 3, 2, 9, [2, 5, 0, 10], false],
  [52, "流星改", 3, 3, 9, [2, 6, 0, 10], false],
  [242, "Swordfish", 2, 2, 9, [1, 1, 0, 1], false],
  [23, "九九式艦爆", 1, 0, 10, [1, 1, 0, 2], false],
  [24, "彗星", 2, 1, 10, [2, 3, 0, 3], false],
  [57, "彗星一二型甲", 3, 2, 10, [2, 3, 0, 4], false],
  [60, "零式艦戦62型(爆戦)", 3, 2, 10, [1, 3, 0, 3], false],
  [195, "SBD", 2, 2, 10, [1, 3, 0, 2], false],
  [54, "彩雲", 3, 2, 11, [2, 0, 0, 11], false],
  [61, "二式艦上偵察機", 2, 1, 11, [3, 1, 0, 13], false],
  [25, "零式水上偵察機", 1, 1, 12, [1, 1, 0, 2], false],
  [26, "瑞雲", 2, 1, 12, [2, 3, 0, 5], false],
  [59, "零式水上観測機", 2, 1, 12, [1, 1, 0, 2], false],
  [163, "Ro.43水偵", 3, 3, 12, [1, 1, 0, 2], false],
  [194, "Laté 298B", 3, 3, 12, [2, 4, 0, 5], false],
  [207, "瑞雲(六三一空)", 3, 3, 12, [2, 3, 0, 5], false],
  [27, "13号対空電探", 2, 1, 13, [0, 0, 10, 10], false],
  [28, "22号対水上電探", 2, 1, 13, [0, 0, 15, 15], false],
  [29, "33号対水上電探", 3, 2, 13, [0, 0, 20, 15], false],
  [30, "21号対空電探", 2, 2, 13, [0, 0, 20, 20], false],
  [31, "32号対水上電探", 3, 3, 13, [0, 0, 20, 25], false],
  [32, "42号対空電探", 3, 4, 13, [0, 0, 25, 25], false],
  [44, "九四式爆雷投射機", 1, 0, 14, [0, 2, 1, 1], false],
  [45, "三式爆雷投射機", 3, 2, 14, [0, 3, 1, 1], false],
  [46, "九三式水中聴音機", 1, 0, 14, [0, 0, 1, 1], false],
  [47, "三式水中探信儀", 3, 2, 14, [0, 0, 1, 2], false],
  [226, "九五式爆雷", 1, 1, 14, [1, 2, 0, 1], false],
  [33, "改良型艦本式タービン", 1, 0, 15, [10, 0, 10, 0], false],
  [34, "強化型艦本式缶", 2, 1, 15, [10, 0, 20, 0], false],
  [72, "増設バルジ(中型艦)", 2, 2, 16, [0, 0, 12, 0], false],
  [73, "増設バルジ(大型艦)", 2, 2, 16, [0, 0, 30, 0], false],
  [168, "九六式陸攻", 1, 1, 17, [7, 4, 0, 12], false],
  [75, "ドラム缶(輸送用)", 1, 0, 18, [0, 0, 1, 0], false],
  [120, "91式高射装置", 1, 1, 19, [0, 1, 0, 1], false],
  [250, "Spitfire Mk.I", 3, 3, 20, [1, 2, 0, 4], false],
];

// var k = 0;
// for (var j = 0; j < itemtypenames.length; ++j) {
//   for (var i = 0; i < itemlist.length; ++i) {
//     if (itemlist[i][4] == j) {
//       items[k] = itemlist[i];
//       k++;
//     }
//   }
// }

function developResult(id, percentage, materials, hqlevel) {
  this.id = id;
  this.percentage = percentage;
  this.successful = true;
  for (let j = 0; j < items.length; ++j) {
    if (items[j][0] == id) {
      if (items[j][3] * 10 > hqlevel) this.successful = false;
      for (let i = 0; i < 4; ++i) {
        if (items[j][5][i] * 10 > materials[i]) {
          this.successful = false;
          break;
        }
      }
    }
  }

  this.toTRNode = function () {
    let itemid;
    for (let j = 0; j < items.length; ++j) {
      if (items[j][0] == id) {
        itemid = j;
      }
    }

    var node = document.createElement("tr");
    if (this.successful) node.className = "success";
    else {
      node.className = "fail";
      var title = "Require";
      for (var i = 0; i < 4; ++i) {
        if (items[itemid][5][i] * 10 > materials[i]) {
          title +=
            "\n" +
            getString(materialNames[i]) +
            " ≥ " +
            items[itemid][5][i] * 10;
        }
      }
      if (items[itemid][3] * 10 > hqlevel) {
        title += "\n" + getString("HQ Level") + " ≥ " + items[itemid][3] * 10;
      }
      node.title = getString(title);
    }
    var tdnode = document.createElement("td");
    tdnode.className = "type" + (items[itemid][6] ? 4 : items[itemid][4]);
    tdnode.appendChild(document.createTextNode(items[itemid][1]));
    node.appendChild(tdnode);
    tdnode = document.createElement("td");
    tdnode.appendChild(document.createTextNode(percentage + "%"));
    node.appendChild(tdnode);
    return node;
  };
}
